app/controllers/answers_controller.rb

  def update
    current_user
    @best_answer = Answer.find(params[:id])
    @question = @best_answer.question
    @answer = Answer.new
    @answers = @question.answers.order(best: :desc, created_at: :asc)

    if @current_user.nil?
      flash[:notice] = "You must log in"
      redirect_to question_path(@question)
    elsif @current_user.id != @question.user_id
      flash[:notice] = "You do not have permission to edit this question"
      redirect_to question_path(@question)
    else
      @answers.update_all best: false
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."best" DESC, "answers"."created_at" ASC  [["question_id", 8]]
UPDATE "answers" SET "best" = 'f' WHERE "answers"."id" IN (SELECT "answers"."id" FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."best" DESC, "answers"."created_at" ASC)  [["question_id", 20]]

  def create
    current_user
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answers = @question.answers.order(created_at: :asc)

    if @current_user.nil?
      flash[:notice] = 'Please sign in before deleting a question'
      render 'questions/show'
    else
      @answer.question = @question
      @answer.user_id = @current_user.id
      if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."created_at" ASC  [["question_id", 2]]
INSERT INTO "answers" ("body", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "fgkmdfklgmdlkfg"], ["question_id", 7], ["user_id", 1], ["created_at", "2016-03-23 17:01:56.663248"], ["updated_at", "2016-03-23 17:01:56.663248"]]