app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.all.order(created_at: :DESC)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."best" DESC, "answers"."created_at" ASC  [["question_id", 15]]
---
  def show
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = @question.answers.order(best: :desc, created_at: :asc)

INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    current_user
    @question = Question.new(question_params)
    @question.user_id = @current_user.id

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."best" DESC, "answers"."created_at" ASC  [["question_id", 20]]
---
  def edit
    current_user
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = @question.answers.order(best: :desc, created_at: :asc)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "1my rspec is not working. i am having trouble getting rspec to work?"], ["updated_at", "2016-03-22 16:58:14.667444"], ["id", 2]]
---
  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."created_at" ASC  [["question_id", 6]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]
---
  def destroy
    current_user
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = @question.answers.order(created_at: :asc)

    if @current_user.nil?
      flash[:notice] = 'Please sign in before deleting a question'
      render :show and return
    elsif @current_user.id != @question.user_id
      flash[:notice] = 'Please sign in before deleting this question'
      redirect_to root_url and return
    end

    @question.destroy